package main

func main() {
	// 1.算术运算符
	/*
		+  加
		-  减
		*  乘
		/  除
		%  取余
		PS: 运算符没有整除
	*/

	// 2.关系运算符
	/*
		== 判断两个值是否相等
		!= 判断两个值是否不相等
		>  检查左边的值是否大于右边的值
		>= 检查左边的值是否大于等于右边的值
		<  检查左边的值是否小于右边的值
		<= 检查左边的值是否小于右边的值
	*/

	// 3.逻辑运算符
	/*
		&&  与
		||  或
		!   非
	*/

	// 4.位运算符
	/*
		&	参与运算的两数各对应的二进位相与。
		（两位均为1才为1）
		|	参与运算的两数各对应的二进位相或。
		（两位有一个为1就为1）
		^	参与运算的两数各对应的二进位相异或，当两对应的二进位相异时，结果为1。
		（两位不一样则为1）
		<<	左移n位就是乘以2的n次方。
		“a<<b”是把a的各二进位全部左移b位，高位丢弃，低位补0。
		>>	右移n位就是除以2的n次方。
		“a>>b”是把a的各二进位全部右移b位
	*/

	// 5.赋值运算符
	/*
		=	简单的赋值运算符，将一个表达式的值赋给一个左值
		+=	相加后再赋值
		-=	相减后再赋值
		*=	相乘后再赋值
		/=	相除后再赋值
		%=	求余后再赋值
		<<=	左移后赋值
		>>=	右移后赋值
		&=	按位与后赋值
		|=	按位或后赋值
		^=	按位异或后赋值
	*/

}
